Tester1cExpansion/src/InformationRegisters/Tester_ШаблонныеДанные/Tester_ШаблонныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Tester_ШаблонныеДанные</name>
  <resources>
    <name>ХранилищеШаблонныхДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблоннаяСхема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>UIDОбъекта</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester1cExpansion/src/CommonModules/TesterКлСрв/Module.bsl
Функция ПолучитьТекстЗапросаДляВыбораШаблонныхДанных(ВыбиратьШаблонныеДанные) ЭКСПОРТ
	ТекстЗапроса = "ВЫБРАТЬ
	|	Tester_ШаблонныеДанные.ПредставлениеUID КАК ЗначениеВыбора,
	|	Tester_ШаблонныеДанные.НаименованиеШаблона КАК Наименование
	|ИЗ
	|	РегистрСведений.Tester_ШаблонныеДанные КАК Tester_ШаблонныеДанные
	|ГДЕ
	|	&ЭтоШаблоннаяСхема
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Если ВыбиратьШаблонныеДанные = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоШаблоннаяСхема","ИСТИНА"); 
	ИначеЕсли ВыбиратьШаблонныеДанные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоШаблоннаяСхема","Tester_ШаблонныеДанные.ЭтоШаблоннаяСхема");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоШаблоннаяСхема","НЕ Tester_ШаблонныеДанные.ЭтоШаблоннаяСхема");
	КонецЕсли;
				
	Возврат ТекстЗапроса;
КонецФункции
